


INSERT INTO `users` (`uid`, `username`, `email`, `status`) VALUES
('10', '喵喵A', 'tester10@gmail.com.tw', 1),
('82', '喵喵B', 'tester82@yahoo.com.tw', 1);



-- 插入 10 筆交易資料 (包含 tool 裡面寫死的資料)
INSERT INTO `transactions` (`transaction_id`, `user_id`, `amount`, `currency`, `location`, `status`, `idempotency_key`, `created_at`) VALUES
('TXN-20260430-001', '10', 100.00, 'TWD', '台北', 'SUCCESS', 'ik-001', '2026-04-30 10:00:00'),
('TXN-20260430-002', '10', 50000.00, 'TWD', '倫敦', 'SUCCESS', 'ik-002', '2026-04-30 10:05:00'),
('TXN-20260430-003', '82', 100.00, 'TWD', '台北', 'SUCCESS', 'ik-003', '2026-04-30 10:10:00'),
('TXN-20260430-004', '10', 100.00, 'TWD', '紐約', 'SUCCESS', 'ik-004', '2026-04-30 10:19:00'),
('TXN-20260430-005', '10', 3000.00, 'TWD', '台北', 'SUCCESS', 'ik-005', '2026-04-30 11:00:00'),
('TXN-20260430-006', '10', 1500.00, 'TWD', '台北', 'SUCCESS', 'ik-006', '2026-04-30 12:30:00'),
('TXN-20260430-007', '82', 50.00, 'TWD', '台中', 'SUCCESS', 'ik-007', '2026-04-30 13:00:00'),
('TXN-20260430-008', '10', 8000.00, 'TWD', '台北', 'PENDING', 'ik-008', '2026-04-30 14:15:00'),
('TXN-20260430-009', '10', 200.00, 'TWD', '台北', 'SUCCESS', 'ik-009', '2026-04-30 15:00:00'),
('TXN-20260430-010', '10', 12000.00, 'TWD', '倫敦', 'RISK_REJECTED', 'ik-010', '2026-04-30 15:45:00');
